Дошкольное_учреждение83/src/Catalogs/ВнутренниеДокументы/ВнутренниеДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВнутренниеДокументы</name>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыВнутреннихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Дело</name>
    <type>
      <types>CatalogRef.ДелаХраненияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Зарегистрировал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛистов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПриложений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистовВПриложениях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Папка</name>
    <type>
      <types>CatalogRef.ПапкиВнутреннихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение подготовившего</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <comment>Плановый срок исполнения</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Утвердил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧисловойНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корреспондент</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>удуДержательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>удуРебенок</name>
    <type>
      <types>CatalogRef.удуДети</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>удуДети</name>
    <attributes>
      <name>Ребенок</name>
      <type>
        <types>CatalogRef.удуДети</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/InformationRegisters/СостоянияДокументов/СостоянияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияДокументов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияДокументов</types>
    </type>
  </resources>
  <attributes>
    <name>Установил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>BusinessProcessRef</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/Catalogs/ВнутренниеДокументы/ManagerModule.bsl
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
    // Устанавливаем признак достпности печати по-комплектно
    ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Карточка") Тогда

        // Формируем табличный документ и добавляем его в коллекцию печатных форм
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
            "Карточка", "Карточка внутреннего документа", ПечатьКарточку(МассивОбъектов, ОбъектыПечати));

	КонецЕсли;
		
КонецПроцедуры

Функция ПечатьКарточку(МассивОбъектов, ОбъектыПечати)
	
	// Создаем табличный документ и устанавливаем имя параметров печати
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_КарточкаВнутреннегоДокумента";
	
	// Получаем запросом необходимые данные
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВнутреннийДокумент.ДатаРегистрации КАК ДатаРегистрации,
	|	ВнутреннийДокумент.ВидДокумента КАК ВидДокумента,
	|	ВнутреннийДокумент.Дело КАК Дело,
	|	ВнутреннийДокумент.Зарегистрировал КАК Зарегистрировал,
	|	ВнутреннийДокумент.Заголовок КАК Наименование,
	|	ВнутреннийДокумент.РегистрационныйНомер КАК РегистрационныйНомер,
	|	ВнутреннийДокумент.Папка КАК Папка,
	|	ВнутреннийДокумент.СрокИсполнения КАК ПлановыйСрокИсполнения,
	|	ВнутреннийДокумент.Подготовил КАК Подготовил,
	|	ВнутреннийДокумент.Содержание КАК Содержание,
	|	ВнутреннийДокумент.КоличествоЛистов КАК КоличествоЛистов,
	|	ВнутреннийДокумент.КоличествоПриложений КАК КоличествоПриложений,
	|	ВнутреннийДокумент.ЛистовВПриложениях КАК ЛистовВПриложениях,
	|	ВнутреннийДокумент.Подразделение КАК Подразделение,
	|	ВнутреннийДокумент.Утвердил КАК Утвердил,
	|	ВнутреннийДокумент.Представление КАК Представление,
	|	ВнутреннийДокумент.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(СостоянияДокументовУтверждение.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаУтверждения,
	|	ЕСТЬNULL(СостоянияДокументовИсполнен.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ФактическийСрокИсполнения,
	|	ВЫБОР
	|		КОГДА СостоянияДокументовИсполнен.Период ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Исполнен
	|ИЗ
	|	Справочник.ВнутренниеДокументы КАК ВнутреннийДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СостоянияДокументов.Документ КАК Документ,
	|			МАКСИМУМ(СостоянияДокументов.Период) КАК Период
	|		ИЗ
	|			РегистрСведений.СостоянияДокументов КАК СостоянияДокументов
	|		ГДЕ
	|			СостоянияДокументов.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДОкументов.Утвержден)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СостоянияДокументов.Документ) КАК СостоянияДокументовУтверждение
	|		ПО (СостоянияДокументовУтверждение.Документ = ВнутреннийДокумент.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СостоянияДокументов.Документ КАК Документ,
	|			МАКСИМУМ(СостоянияДокументов.Период) КАК Период
	|		ИЗ
	|			РегистрСведений.СостоянияДокументов КАК СостоянияДокументов
	|		ГДЕ
	|			СостоянияДокументов.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДОкументов.Исполнен)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СостоянияДокументов.Документ) КАК СостоянияДокументовИсполнен
	|		ПО (СостоянияДокументовИсполнен.Документ = ВнутреннийДокумент.Ссылка)
	|ГДЕ
	|	ВнутреннийДокумент.Ссылка В(&МассивОбъектов)";

	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	Макет = Справочники.ВнутренниеДокументы.ПолучитьМакет("Карточка");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	ПервыйДокумент = Истина;
	Пока Шапка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки с которой начали выводить текущий документ
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		
		ОбластьЗаголовок.Параметры.Заполнить(Шапка);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);

		ОбластьШапка.Параметры.Заполнить(Шапка);
		
		Если ЗначениеЗаполнено(Шапка.КоличествоЛистов) И ЗначениеЗаполнено(Шапка.КоличествоПриложений) И ЗначениеЗаполнено(Шапка.ЛистовВПриложениях) Тогда
			ОбластьШапка.Параметры.Состав = "Листов " + Строка(Шапка.КоличествоЛистов) + ", приложений " + Строка(Шапка.КоличествоПриложений) + ", листов в приложениях " + Строка(Шапка.ЛистовВПриложениях);
		ИначеЕсли ЗначениеЗаполнено(Шапка.КоличествоЛистов) И ЗначениеЗаполнено(Шапка.КоличествоПриложений) Тогда 
			ОбластьШапка.Параметры.Состав = "Листов " + Строка(Шапка.КоличествоЛистов) + ", приложений " + Строка(Шапка.КоличествоПриложений);
		ИначеЕсли ЗначениеЗаполнено(Шапка.КоличествоЛистов) Тогда 
			ОбластьШапка.Параметры.Состав = "Листов " + Строка(Шапка.КоличествоЛистов);	
		КонецЕсли;	
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		
		// В табличном документе зададим имя области в которую был 
		// выведен объект. Нужно для возможности печати по-комплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции
